In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

## descibe()

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
df.describe()  #숫자인 것들만 보임(숫자가 아닌 데이터는 describe X)

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- count : 개수
- mean : 평균
- std : 표준편차
- min : 최솟값
- max : 최댓값
- % -> 백분위에 따른 위치(100개의 데이터 중 순서대로 25번째 데이터)/ 50% : 중앙값

In [6]:
df.describe(include='object') #글자 통계

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

- unique : 그 안의 고유값 개수
- top : 가장 많이 등장하는 데이터
- freq : 총 몇 번 등장했는지

### count()

In [7]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [9]:
df['age'].count()

np.int64(714)

In [17]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### mean()

In [10]:
arr = np.arange(15).reshape(3, 5)
temp_df = pd.DataFrame(arr)
temp_df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [11]:
temp_df.mean()

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [14]:
df.mean(numeric_only=True)  #숫자만 평균 내 주세요 - numeric_only

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [15]:
df['age'].mean()

np.float64(29.69911764705882)

In [16]:
c1 = df['adult_male'] == True
df.loc[c1, 'age'].mean()

np.float64(33.17312348668281)

- fare를 30 이상 40 미만 지물한 승객
- pclass는 1등급

=> 나이 평균 / count

In [21]:
c1 = df['fare'] >= 30
c2 = df['fare'] < 40
c3 = df['pclass'] == 1

print(df.loc[(c1 & c2) & c3, 'age'].mean())
print(df.loc[(c1 & c2) & c3, 'age'].count())

44.095238095238095
21

In [25]:
df.mean(numeric_only=True, skipna=False) #skipna -> skip not a number (nan 있으면 계산 안 함)

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

### median()

In [29]:
pd.Series([1, 2, 3, 4, 9]).median()

np.float64(3.0)

In [30]:
pd.Series([1, 2, 3, 4, 9]).mean()

np.float64(3.8)

In [33]:
pd.Series([1, 2, 3, 4, 5, 6]).median()  #짝수개의 경우 가운데 두 개 값 평균

np.float64(3.5)

In [34]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_value)

29.69911764705882 28.0

### sum

In [36]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [37]:
df['fare'].sum()

np.float64(28693.9493)

In [39]:
df['fare'].cumsum()  #cumsum = 누적합

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [42]:
df['age'].cumprod()   #cumprod = 누적곲

C:\Users\2-15\Desktop\DMF\pandas\venv\Lib\site-packages\numpy\_core\fromnumeric.py:57: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

### var (분산)

In [50]:
# 평균
fare_mean = df['fare'].values.mean()

#총합
total = ((df['fare'].values - fare_mean) ** 2).sum()

#개수
total_count = df['fare'].count() - 1


my_var = total / total_count
my_var

np.float64(2469.436845743116)

In [49]:
df['fare'].var()

np.float64(2469.436845743116)

### std

In [53]:
np.sqrt(df['fare'].var())  #np.sqrt = 루트

np.float64(49.6934285971809)

In [54]:
df['fare'].std()

np.float64(49.6934285971809)

### min, max

In [55]:
df['age'].min()

np.float64(0.42)

In [56]:
df['age'].max()

np.float64(80.0)

### agg

In [60]:
df['age'].agg(['mean', 'std'])   #agg -> aggregation 집합

mean    29.699118
std     14.526497
Name: age, dtype: float64

In [61]:
df[['age', 'fare']].agg(['mean', 'count', 'min', 'max'])

              age        fare
mean    29.699118   32.204208
count  714.000000  891.000000
min      0.420000    0.000000
max     80.000000  512.329200

### quantile (분위)

In [66]:
df['age'].quantile(0.1)  #하위 10% 데이터 보기 // quantile(0부터 1사이 수)

np.float64(14.0)

In [67]:
df['age'].quantile(0.9)  #상위 10% 데이터

np.float64(50.0)

In [68]:
df['age'].quantile(0.5)  #중간값

np.float64(28.0)

### unique

In [69]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [70]:
df['who'].nunique()

3

### mode()

In [71]:
df['who'].mode()

0    man
Name: who, dtype: object

In [72]:
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

### corr()

- -1(반비례) ~ 1(정비례) 까지의 값

In [75]:
df.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [76]:
df.corr(numeric_only=True)['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64